name: "CaffeNet"

#####[INPUTS]####
layers {
  name: "labeled_data"
  type: DATA
  top: "labeled_data"
  top: "label"
  data_param {
    source: "/media/raid_arr/data/ndsb/augment/ndsb_trainaug_lmdb"
    backend: LMDB
    batch_size: 384
  }
  transform_param {
    crop_size: 57
    mean_file: "/media/raid_arr/data/ndsb/augment/testaug_mean.binaryproto"
    mirror: true
  }
}

#########################[Main Net]#############################

##[1]##
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "labeled_data"
  top: "conv1"
  convolution_param {
    num_output: 96
    kernel_size: 5
    stride: 4
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
##[2]##

layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
##[3]##
layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}
##[4]##
layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "conv3"
  top: "conv4"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layers {
  name: "relu4"
  type: RELU
  bottom: "conv4"
  top: "conv4"
}
##[5]##
layers {
  name: "conv5"
  type: CONVOLUTION
  bottom: "conv4"
  top: "conv5"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layers {
  name: "relu5"
  type: RELU
  bottom: "conv5"
  top: "conv5"
}
layers {
  name: "pool5"
  type: POOLING
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}


####[FC]####
layers {
  name: "fc1"
  type: INNER_PRODUCT
  bottom: "pool5"
  top: "fc1"
  inner_product_param {
    num_output: 2048
  }
}
layers {
  name: "relu_fc1"
  type: RELU
  bottom: "fc1"
  top: "fc1"
}
layers {
  name: "drop1"
  type: DROPOUT
  bottom: "fc1"
  top: "fc1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "fc2"
  type: INNER_PRODUCT
  bottom: "fc1"
  top: "fc2"
  inner_product_param {
    num_output: 2048
  }
}
layers {
  name: "relu_fc2"
  type: RELU
  bottom: "fc2"
  top: "fc2"
}
layers {
  name: "drop2"
  type: DROPOUT
  bottom: "fc2"
  top: "fc2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "fc3"
  type: INNER_PRODUCT
  bottom: "fc2"
  top: "fc3"
  inner_product_param {
    num_output: 121
  }
  param: "fc3_w"
  param: "fc3_b"
}


#######[LOSS FUNCTIONS AND OUTPUT]#######
layers {
  name: "labled_loss"
  type: SOFTMAX_LOSS
  bottom: "fc3"
  bottom: "label"
  top: "labled_loss"
  loss_weight: 1
}
